Autodesk.Revit.DB.Categories.Item(Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object matching an identifier.
Retrieves a category object corresponding to a BuiltInCategory id.
Remarks:  Unlike the method that obtains categories by name, this routine will obtain
the handle even of built-in subcategories.
Since 2016 it is advised to use either Category.​​​GetCategory(​Document, ​BuiltIn​Category)
or Category.​​​GetCategory(​Document,​ ElementId)​ from Autodesk.Revit.DB.Category class.